import {useState} from "react";

const Questions = () => {
    const [activeQuestion, setActiveQuestion] = useState<number | null>(null);
    const questionsList = [
        {
            title: "Як знайти потрібну страву чи заклад?",
            subtitle:
                "Ви можете скористатися пошуком на головній сторінці, вибрати категорію страв або скористатися фільтрами для швидкого пошуку.",
        },
        {
            title: "Як оформити замовлення?",
            subtitle:
                "Додайте страву в кошик, перевірте замовлення та натисніть «Оформити».",
        },
        {
            title: "Чи можна оплатити карткою?",
            subtitle:
                "Так, ви можете оплатити онлайн або під час отримання замовлення.",
        },
        {
            title: "Як відстежити своє замовлення?",
            subtitle:
                "Після оформлення замовлення ви отримаєте статуси та повідомлення у профілі або на пошту.",
        },
        {
            title: "Чи можна скасувати замовлення?",
            subtitle:
                "Скасування можливе до того, як заклад підтвердить його. Перевіряйте статус у додатку.",
        },
        {
            title: "Як змінити адресу доставки?",
            subtitle:
                "Ви можете змінити адресу у своєму профілі або безпосередньо перед підтвердженням замовлення.",
        },
        {
            title: "Чи можна залишити відгук про страву?",
            subtitle:
                "Так, після отримання замовлення ви можете оцінити страву та залишити коментар у профілі.",
        },
        {
            title: "Які години роботи сервісу?",
            subtitle:
                "Сервіс працює щодня з 9:00 до 23:00. Деякі заклади можуть мати інший графік.",
        },
        {
            title: "Чи можна використовувати промокоди?",
            subtitle:
                "Так, введіть промокод під час оформлення замовлення, і знижка автоматично застосується.",
        },
        {
            title: "Що робити, якщо замовлення не прийшло?",
            subtitle:
                "Зв'яжіться зі службою підтримки через додаток або за телефоном, вказаним у замовленні.",
        },
    ];


    return (
        <div>
            <div className='space-y-5'>
                {questionsList.map((question, index) => (
                    <div onClick={() => setActiveQuestion(activeQuestion === index ? null : index)} key={index} className='rounded-[16px] p-[14px] w-full bg-white-col'>
                        <h2 className='font-medium'>{question.title}</h2>
                        {activeQuestion === index && (
                            <p className='mt-5 text-dark-gray'>{question.subtitle}</p>

                        )}
                    </div>
                ))}
            </div>
        </div>
    );
};

export default Questions;